[
  {
    "title": "BeachFix",
    "slug": "beachfix",
    "types": ["Design", "Development"],
    "colors": ["#0773bb", "#ffd881"],
    "coverImages": ["beachfix/beachfix-cover-mobile.png", "beachfix/beachfix-cover-desktop.png"],
    "previewImages": {
      "mobile": "beachfix/beachfix-phone.png",
      "desktop": "beachfix/beachfix-desktop.png"
    },
    "deliverables": "Design and make a web application",
    "stack": ["React", "Express", "NodeJS"],
    "url": "http://beachfix.co",
    "date": "2016",
    "aboutCompany": "BeachFix is a tool for helping people find their dream beach holiday. The startup was founded in 2015 after CEO, Nishul, noticed that the gigantic holiday market was only catered to by a hand full of big holiday websites. He set out capture a slice of the market—the beach holiday goers—with BeachFix.",
    "whatIDid": [
      "I was hired to make the first non-beta version of the BeachFix website.",
      "Worked with the team to translate lessons they had learned from the beta into new designs.",
      "The design process started on paper and progressed to InVision prototypes. InVision allowed us to see everything in one place and make iterative changes where necessary.",
      "I used React to create the new isomorphic web application.",
      "I coded the new app to a very tight deadline, delivering it in under a month.",
      "Implemented several methods of collecting usage data once the app was launched. The data was used to gain insight into whether our assumptions were valid. If they weren't, we changed it.",
      "Spent three days working side-by-side with the team when handing the project over to them."
    ],
    "quotes": null
  },
  {
    "title": "TopHat Films",
    "slug": "tophat",
    "types": ["Design", "Development", "Wordpress"],
    "colors": ["#1f1f1f", "#dedede"],
    "coverImages": ["tophat/tophat-cover-mobile.png", "tophat/tophat-cover-desktop.png"],
    "previewImages": {
      "mobile": "tophat/tophat-phone.png",
      "desktop": "tophat/tophat-desktop.png"
    },
    "deliverables": "Design and make a light weight website and blog",
    "stack": ["Valilla JS", "Wordpress"],
    "url": "http://thetophatfilmswebsite.com",
    "date": "2016",
    "aboutCompany": "TopHat Films was started by filmmaker Rob Trott while he was still in school, and was mostly a way for him and his mates to learn how to make films and having fun with it. In the years since, TopHat have a feature length film (4:00am), and a web series (DOLE) to their name, plus some interesting things in the works.",
    "whatIDid": [
      "I delivered a new responsive website and blog for TopHat Films.",
      "Invented a <a href=\"https://github.com/nosajj/micro-templating\" target=\"_blank\">micro templating library</a> to make adding new content easier.",
      "Worked with Rob on injecting some TopHat humour into the site (we introduced some fun hidden and not-so-hidden interactive surprises).",
      "Developed a simple way for Rob to add new projects to the website without learning how to code and without the need for a CMS."
    ],
    "quotes": null
  },
  {
    "title": "MetaBroadcast",
    "slug": "mbst",
    "types": ["Creative Technologist"],
    "colors": ["#330068", "#FF009A"],
    "deliverables": "Worked on projects for MetaBroadcast, BBC R&D, Channel 4, and others.",
    "url": null,
    "links": {
      "The MetaBroadcast Website": "http://metabroadcast.com"
    },
    "date": "2014 to 2015",
    "aboutCompany": "MetaBroadcast, started in 2004, have positioned themselves to be indispensable in the modern world of Television and digital media. They make a number of products that help broadcasters in the UK get content to viewers faster. They also work on commissions to develop interesting solutions using a wide range of technologies.",
    "whatIDid": [
      "Working at Meta taught me how to bring my A game every single day. The level of work expectated required it.",
      "I became well versed in Angular, Ember, and Backbone frameworks, and I regularly worked with NodeJS, BASH, Python, and Ruby.",
      "Worked on projects for BBC R&D, Channel 4 and others.",
      "Talked on numerous occasions at the monthly MetaBeers event to 30+ people.",
      "Got used to working with large scale infrastructure.",
      "Worked to the AGILE methodology for rapid development.",
      "Took part in the hiring process for potential new staff members.",
      "Consumed a LOT of cake."
    ],
    "quotes": null
  },
  {
    "title": "MrSite",
    "slug": "mrsite",
    "types": ["Lead Design"],
    "colors": ["#0976A1", "#c6ffee"],
    "deliverables": "",
    "url": "http://mrsite.com",
    "date": "2012 to 2013",
    "aboutCompany": "MrSite created one of the first successful website builder products on the market. Back in 2004 they took a big chunk of the d.i.y. website market with their product \"Website in a Box\". In 2012, as the industry became more competitive, their (then) newest product wasn't performing as well as they had expected, so moves were made to improve it.",
    "whatIDid": [
      "I joined MrSite in 2012, just after the release of their revamped website builder product. I was responsible in thinking up ways to improve it.",
      "I got involved with support and listening to the issues of existing customers.",
      "I lobbied for better email marketing, and designed new email templates.",
      "I re-skinned the new website builder product, and designed onboarding solutions, like a series of \"quick steps\" to get a user comfortable in the new digs.",
      "I designed and made a new website for the new product, focussing all I'd learned from the team and customers into the project. The resulting site increased website sales by 300% within the first month, and got the website to the first page of Google for the term \"website builder uk\"."
    ],
    "quotes": null
  },
  {
    "title": "William Hill Online",
    "slug": "williamhill",
    "types": ["Developer"],
    "colors": ["#00133D", "#F9DA00"],
    "url": null,
    "links": {
      "The William Hill Website": "http://williamhill.com"
    },
    "date": "2009",
    "aboutCompany": "William Hill are one of the oldest bookmakers in England. They operate worldwide and specialise in sports bets, but they take bets for a wide range of things. The online division of the company is based in Gibraltar along with the tech and content teams.",
    "whatIDid": [
      "I was one of three developers working in Gibraltar. I mostly worked on coding new websites from mockups and on the William Hill poker app for Windows.",
      "Worked with PHP, Expression Engine, MooTools, and jQuery.",
      "I coded the William Hill Casino website myself, working with the internal design team. The website stayed online until 2015.",
      "I moved to Spain, crossing the border daily to work at William Hill."
    ],
    "quotes": null
  }
]
